{
  "slug": "box-line-reduction",
  "title": "Box/Line Reduction",
  "description": "When a candidate in a row or column is confined to a single box, it can be eliminated from other cells in that box.",
  "steps": [
    {
      "title": "What is Box/Line Reduction?",
      "content": "Box/Line Reduction is the reverse of Pointing Pairs. When all candidates for a digit in a row (or column) fall within a single box, that digit can be eliminated from other cells in that box (outside the row/column)."
    },
    {
      "title": "The reverse of Pointing Pairs",
      "content": "With Pointing Pairs, you look inside a box and eliminate along a line. With Box/Line Reduction, you look along a line and eliminate inside a box. They're complementary techniques."
    },
    {
      "title": "Scan a row",
      "content": "Look at row 7. The right side is completely filled, but three cells on the left are empty. The digit 2 doesn't appear among the filled cells, so it must go somewhere in this row.",
      "board": [0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 8, 5, 7, 9, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      "highlightCells": [54, 55, 56, 57, 58, 59, 60, 61, 62],
      "highlightDigits": [2]
    },
    {
      "title": "Identify the box",
      "content": "Looking at where 2 can go in this row: the three empty cells are all in the bottom-left box. But column 3 already has a 2, so cell 56 is blocked. The digit 2 is restricted to just these two cells — both in the same box.",
      "board": [0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 8, 5, 7, 9, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      "highlightCells": [54, 55],
      "highlightDigits": [2]
    },
    {
      "title": "Eliminate within the box",
      "content": "Since 2 must be in row 7 within this box, we can remove 2 from all other cells in the box that aren't in row 7. The digit 2 is claimed by the row's intersection with the box.",
      "board": [0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 8, 5, 7, 9, 1, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
      "highlightCells": [63, 64, 65, 72, 73, 74],
      "highlightDigits": [2]
    },
    {
      "title": "Column version",
      "content": "The same logic works for columns. If a digit in a column only appears within one box, eliminate that digit from other cells in the box that aren't in the column."
    },
    {
      "title": "Searching strategy",
      "content": "For each row (or column), check each digit. If all candidates for that digit fall within a single box, check the rest of that box for eliminations. This technique pairs well with Pointing Pairs — always check both directions."
    },
    {
      "title": "Why it matters",
      "content": "Box/Line Reduction and Pointing Pairs together form a powerful toolkit for intermediate puzzles. They exploit the interaction between rows/columns and boxes, opening up cells that basic techniques miss."
    }
  ]
}
